zephyrproject-rtos/zephyr/boards/nxp/mimxrt700_evk/board.c
#elif CONFIG_SOC_MIMXRT798S_CM33_CPU1
	/* Power up OSC in case it's not enabled. */
	POWER_DisablePD(kPDRUNCFG_PD_SYSXTAL);
	/* Enable system OSC */
	CLOCK_EnableSysOscClk(true, true, SYSOSC_SETTLING_US);
	/* Sets external XTAL OSC freq */
	CLOCK_SetXtalFreq(XTAL_SYS_CLK_HZ);

	CLOCK_AttachClk(kFRO1_DIV3_to_SENSE_BASE);
	CLOCK_SetClkDiv(kCLOCK_DivSenseMainClk, 1);
	CLOCK_AttachClk(kSENSE_BASE_to_SENSE_MAIN);

	POWER_DisablePD(kPDRUNCFG_GATE_FRO2);
	CLOCK_EnableFroClkFreq(FRO2, 300000000U, kCLOCK_FroAllOutEn);

	CLOCK_EnableFro2ClkForDomain(kCLOCK_AllDomainEnable);

	CLOCK_AttachClk(kFRO2_DIV3_to_SENSE_BASE);
	CLOCK_SetClkDiv(kCLOCK_DivSenseMainClk, 1);
	CLOCK_AttachClk(kSENSE_BASE_to_SENSE_MAIN);

	CLOCK_EnableClock(kCLOCK_SenseAccessRamArbiter0);

	/*
	 * Claim the resources this core runs from, in this core's own run-vote banks.
	 *
	 * Every one of them has a control field in both SLEEPCONs or in both PMCs, and
	 * the PMC aggregates the two cores by selecting each core's run or sleep bank
	 * according to that core's state and then ANDing the two power-down votes (RM
	 * 27.3.2.2). A keep vote from either side is therefore enough, and the core that
	 * uses a resource is the core that has to cast it: CPU0's low-power modes vote
	 * the whole Sense side down, as RM 12.5.2 Table 167 requires of a core that does
	 * not use a common resource, and rely on these bits to hold this core up.
	 *
	 * XTAL and FRO2 are claimed above, where they are configured. What is left is the
	 * rest of the clock tree this core executes from -- the private and the shared
	 * part of sense_main_clk, the RAM arbiter 0 clock just enabled, and the VDDN_COM
	 * main clock its path to the VDD2 peripherals runs through -- plus the VDDN_COM
	 * rail itself. VDD2_COM needs no vote: CPU0 cannot drop it in a mode it returns
	 * from, and the modes that do drop it power this core off with it.
	 */
	POWER_DisablePD(kPDRUNCFG_SHUT_SENSEP_MAINCLK);
	POWER_DisablePD(kPDRUNCFG_SHUT_SENSES_MAINCLK);
	POWER_DisablePD(kPDRUNCFG_SHUT_RAM0_CLK);
	POWER_DisablePD(kPDRUNCFG_SHUT_COMNN_MAINCLK);
	POWER_DisablePD(kPDRUNCFG_DSR_VDDN_COM);

	/*
	 * And the SRAM partitions this image is linked into, text included -- this core
	 * executes from RAM. CPU0 powered them up before releasing this core, but it
	 * hands that vote back once the boot flag goes out, so from then on these bits
	 * are what keeps them.
	 */
	PMC1->PDRUNCFG2 &= ~POWER_SRAM_KEEPALIVE;
	PMC1->PDRUNCFG3 &= ~POWER_SRAM_KEEPALIVE;

	POWER_ApplyPD();
#endif /* CONFIG_SOC_MIMXRT798S_CM33_CPU0 */

	BOARD_InitAHBSC();

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(edma0))
	edma_enable_all_request(0);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(edma1))
	edma_enable_all_request(1);
#endif

#ifdef CONFIG_BOARD_MIMXRT700_EVK_MIMXRT798S_CM33_CPU0
	CLOCK_AttachClk(kOSC_CLK_to_FCCLK0);
	CLOCK_SetClkDiv(kCLOCK_DivFcclk0Clk, 1U);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm0))
	SET_UP_FLEXCOMM_CLOCK(0);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm1))
	SET_UP_FLEXCOMM_CLOCK(1);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm2))
	SET_UP_FLEXCOMM_CLOCK(2);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm3))
	SET_UP_FLEXCOMM_CLOCK(3);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm4))
	SET_UP_FLEXCOMM_CLOCK(4);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm5))
	SET_UP_FLEXCOMM_CLOCK(5);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm6))
	SET_UP_FLEXCOMM_CLOCK(6);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm7))
	SET_UP_FLEXCOMM_CLOCK(7);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm8))
	SET_UP_FLEXCOMM_CLOCK(8);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm9))
	SET_UP_FLEXCOMM_CLOCK(9);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm10))
	SET_UP_FLEXCOMM_CLOCK(10);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm11))
	SET_UP_FLEXCOMM_CLOCK(11);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm12))
	SET_UP_FLEXCOMM_CLOCK(12);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm13))
	SET_UP_FLEXCOMM_CLOCK(13);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpspi14))
	CLOCK_AttachClk(kFRO1_DIV1_to_LPSPI14);
	CLOCK_SetClkDiv(kCLOCK_DivLpspi14Clk, 3U);
	CLOCK_EnableClock(kCLOCK_LPSpi14);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpi2c15))
	/*
	 * LPI2C15 is shared between the two cores, and its functional clock mux
	 * CLKCTL3->LPI2C15FCLKSEL is a single field with no per-core copy, unlike
	 * the clock gate below. Both cores therefore pick FRO1: its rate is fixed,
	 * so neither has to read the Sense base clock selection that only CPU1 can
	 * program, and both derive the same baud divider. Divide by 6 to keep
	 * LPI2C_FCLK at the 32 MHz it is limited to at 0.7 V nominal. FRO1 lives in
	 * VDD2_COM, so move this bus to FRO2 should the Sense domain ever have to
	 * reach the PMIC with VDD2 off.
	 */
	CLOCK_AttachClk(kFRO1_DIV1_to_LPI2C15);
	CLOCK_SetClkDiv(kCLOCK_DivLpi2c15Clk, 6U);
	CLOCK_EnableClock(kCLOCK_LPI2c15);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpspi16))
	CLOCK_AttachClk(kFRO0_DIV1_to_LPSPI16);
	CLOCK_SetClkDiv(kCLOCK_DivLpspi16Clk, 1U);
	CLOCK_EnableClock(kCLOCK_LPSpi16);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm17))
	CLOCK_AttachClk(kSENSE_BASE_to_FLEXCOMM17);
	CLOCK_SetClkDiv(kCLOCK_DivLPFlexComm17Clk, 4U);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm18))
	CLOCK_AttachClk(kSENSE_BASE_to_FLEXCOMM18);
	CLOCK_SetClkDiv(kCLOCK_DivLPFlexComm18Clk, 4U);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm19))
	CLOCK_AttachClk(kSENSE_BASE_to_FLEXCOMM19);
	CLOCK_SetClkDiv(kCLOCK_DivLPFlexComm19Clk, 4U);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexcomm20))
	CLOCK_AttachClk(kSENSE_BASE_to_FLEXCOMM20);
	CLOCK_SetClkDiv(kCLOCK_DivLPFlexComm20Clk, 4U);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(flexio))
	CLOCK_AttachClk(kFRO0_DIV1_to_FLEXIO);
	CLOCK_SetClkDiv(kCLOCK_DivFlexioClk, 1U);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(ctimer0))
	SET_UP_CTIMER_CLOCK(0);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(ctimer1))
	SET_UP_CTIMER_CLOCK(1);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(ctimer2))
	SET_UP_CTIMER_CLOCK(2);
#endif

