zephyrproject-rtos/zephyr/boards/nxp/mimxrt700_evk/board.c
#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(ctimer3))
	SET_UP_CTIMER_CLOCK(3);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(ctimer4))
	SET_UP_CTIMER_CLOCK(4);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(ctimer5))
	SET_UP_CTIMER_CLOCK(5);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(ctimer6))
	SET_UP_CTIMER_CLOCK(6);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(ctimer7))
	SET_UP_CTIMER_CLOCK(7);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpadc0))
	CLOCK_AttachClk(kFRO1_DIV1_to_SENSE_MAIN);
	CLOCK_AttachClk(kSENSE_BASE_to_ADC);
	CLOCK_SetClkDiv(kCLOCK_DivAdcClk, 1U);
#endif

#if (DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(os_timer_cpu0)) || \
		DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(os_timer_cpu1)))
	CLOCK_AttachClk(kLPOSC_to_OSTIMER);
	CLOCK_SetClkDiv(kCLOCK_DivOstimerClk, 1U);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(irtc_wake))
	/*
	 * The current irtc_wake counter driver does not yet integrate
	 * clock control functionality, so it is temporarily integrated
	 * in board.c for now; it should be moved into the driver in the
	 * future.
	 */
	clock_osc32k_config_t osc32k_cfg = {
		.bypass = false,
		.monitorEnable = false,
		.lowPowerMode = true,
		.cap = kCLOCK_Osc32kCapPf16,
	};

	CLOCK_EnableOsc32K(&osc32k_cfg);
	CLOCK_EnableClock(kCLOCK_Rtc);
#endif

#if ((DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(usb0)) && CONFIG_UDC_NXP_EHCI) || \
	(DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(usbh0)) && (CONFIG_UHC_NXP_EHCI)))
	/* Power on COM VDDN domain for USB */
	POWER_DisablePD(kPDRUNCFG_DSR_VDDN_COM);

	/* Power on usb ram array as need, powered USB0RAM array*/
	POWER_DisablePD(kPDRUNCFG_APD_USB0_SRAM);
	POWER_DisablePD(kPDRUNCFG_PPD_USB0_SRAM);
	/* Apply the config */
	POWER_ApplyPD();
	/* disable the read and write gate */
	SYSCON4->USB0_MEM_CTRL |= (SYSCON4_USB0_MEM_CTRL_MEM_WIG_MASK |
				   SYSCON4_USB0_MEM_CTRL_MEM_RIG_MASK |
				   SYSCON4_USB0_MEM_CTRL_MEM_STDBY_MASK);
	/* Enable the USBPHY0 CLOCK */
	SYSCON4->USBPHY0_CLK_ACTIVE |= SYSCON4_USBPHY0_CLK_ACTIVE_IPG_CLK_ACTIVE_MASK;
	CLOCK_AttachClk(k32KHZ_WAKE_to_USB);
	CLOCK_AttachClk(kOSC_CLK_to_USB_24MHZ);
	RESET_PeripheralReset(kUSB0_RST_SHIFT_RSTn);
	RESET_PeripheralReset(kUSBPHY0_RST_SHIFT_RSTn);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(usdhc0)) && CONFIG_IMX_USDHC
	/*Make sure USDHC ram buffer has power up*/
	POWER_DisablePD(kPDRUNCFG_APD_SDHC0_SRAM);
	POWER_DisablePD(kPDRUNCFG_PPD_SDHC0_SRAM);
	POWER_DisablePD(kPDRUNCFG_PD_LPOSC);
	POWER_ApplyPD();

	/* USDHC0 */
	/* usdhc depend on 32K clock also */
	CLOCK_AttachClk(kLPOSC_DIV32_to_32K_WAKE);
	CLOCK_InitAudioPfd(kCLOCK_Pfd0, 24U); /* Target 400MHZ. */
	CLOCK_AttachClk(kAUDIO_PLL_PFD0_to_SDIO0);
	CLOCK_SetClkDiv(kCLOCK_DivSdio0Clk, 1);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(usdhc1)) && CONFIG_IMX_USDHC
	/* Make sure USDHC1 ram buffer has power up */
	POWER_DisablePD(kPDRUNCFG_APD_SDHC1_SRAM);
	POWER_DisablePD(kPDRUNCFG_PPD_SDHC1_SRAM);
	POWER_DisablePD(kPDRUNCFG_PD_LPOSC);
	POWER_ApplyPD();

	/* USDHC1 */
	/* usdhc depend on 32K clock also */
	CLOCK_AttachClk(kLPOSC_DIV32_to_32K_WAKE);
	CLOCK_InitAudioPfd(kCLOCK_Pfd0, 24U); /* Target 400MHZ. */
	CLOCK_AttachClk(kAUDIO_PLL_PFD0_to_SDIO1);
	CLOCK_SetClkDiv(kCLOCK_DivSdio1Clk, 1);
	RESET_ClearPeripheralReset(kUSDHC1_RST_SHIFT_RSTn);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(wwdt0))
	CLOCK_AttachClk(kLPOSC_to_WWDT0);
	/* ROM may change ITRC OUT3_SEL0 and OUT4_SEL0, which will select
	 * WWDT0-2 as input for ITRC. When a WWDT timeout happened the
	 * event will first assert and trigger a ITRC reset, This ITRC
	 * reset is faster than WWDT reset and reset the system before
	 * a WWDT reset. Change back the OUT3_SEL0 and OUT4_SEL0 to allow
	 * RSTCTL capturing WWDT reset event.
	 */
	ITRC->OUT_SEL[3][0] = 0xAAAAAA0A;
	ITRC->OUT_SEL[4][0] = 0xAAAAAA0A;
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(sai0)) || \
		DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(micfil))
	CLOCK_AttachClk(kAUDIO_PLL_PFD3_to_AUDIO_VDD2);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(sai0))
	/* SAI clock 368.64 / 15 = 24.576MHz */
	CLOCK_AttachClk(kAUDIO_VDD2_to_SAI012);
	CLOCK_SetClkDiv(kCLOCK_DivSai012Clk, 15U);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(micfil))
	CLOCK_SetClkDiv(kCLOCK_DivMicfil0Clk, 15U);
	CLOCK_AttachClk(kAUDIO_PLL_PFD3_to_MICFIL0);
	RESET_ClearPeripheralReset(kPDM_RST_SHIFT_RSTn);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(sc_timer))
	CLOCK_AttachClk(kFRO0_DIV6_to_SCT);
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(lcdif), nxp_dcnano_lcdif, okay) && \
	CONFIG_DISPLAY
	/* Assert LCDIF reset. */
	RESET_SetPeripheralReset(kLCDIF_RST_SHIFT_RSTn);

	/* Disable media main and LCDIF power down. */
	POWER_DisablePD(kPDRUNCFG_SHUT_MEDIA_MAINCLK);
	POWER_DisablePD(kPDRUNCFG_APD_LCDIF);
	POWER_DisablePD(kPDRUNCFG_PPD_LCDIF);

	/* Apply power down configuration. */
	POWER_ApplyPD();

	CLOCK_AttachClk(kMAIN_PLL_PFD2_to_LCDIF);
	/* Note- pixel clock follows formula
	 * (height  VSW  VFP  VBP) * (width  HSW  HFP  HBP) * frame rate.
	 * this means the clock divider will vary depending on
	 * the attached display.
	 *
	 * The root clock used here is the main PLL (PLL PFD2).
	 */
	CLOCK_SetClkDiv(
		kCLOCK_DivLcdifClk,
		(CLOCK_GetMainPfdFreq(kCLOCK_Pfd2) /
		  DT_PROP(DT_CHILD(DT_NODELABEL(lcdif), display_timings), clock_frequency)));
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(lcdif), nxp_mipi_dbi_dcnano_lcdif, okay)
	/* Assert LCDIF reset. */
	RESET_SetPeripheralReset(kLCDIF_RST_SHIFT_RSTn);

	/* Disable media main and LCDIF power down. */
	POWER_DisablePD(kPDRUNCFG_SHUT_MEDIA_MAINCLK);
	POWER_DisablePD(kPDRUNCFG_APD_LCDIF);
	POWER_DisablePD(kPDRUNCFG_PPD_LCDIF);

	/* Apply power down configuration. */
	POWER_ApplyPD();

	/* Calculate the divider for MEDIA MAIN clock source main pll pfd2. */
	CLOCK_InitMainPfd(kCLOCK_Pfd2, (uint64_t)CLOCK_GetMainPllFreq() * 18UL /
						DT_PROP(DT_NODELABEL(lcdif), clock_frequency));
	CLOCK_SetClkDiv(kCLOCK_DivMediaMainClk, 1U);
	CLOCK_AttachClk(kMAIN_PLL_PFD2_to_MEDIA_MAIN);
#endif

